Revit 2024 API
WidthMeasuredAt Enumeration
 The allowed values for the WALL_TYPE_WIDTH_MEASURED_AT parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum WidthMeasuredAt
Visual Basic
Public Enumeration WidthMeasuredAt
Visual C++
public enum class WidthMeasuredAt
Members
Member name | Description
Top |  The top of the wall taking into account the top offset before any attachment.
Base |  The base constraint of the wall.
Bottom |  The bottom of the wall taking into the base offset before any attachment.
See Also
Autodesk.Revit.DB Namespace